# Phaserのスプライト画像の用意の仕方
- Photoshopなどでパターンを描いて、1枚のグラフィックに並べる
- psd形式とpng形式で保存。Phaserに持っていくのはpng形式
- 保存したpng画像を右クリックして、[送る]>[圧縮(ZIP)]を選んで圧縮する
- エクスプローラーを起動して、[ドキュメント]>[自分の名前]>[lubuntu]フォルダー内に、圧縮したzipファイルをコピー
- Lubuntuに移動
- 共有フォルダーを開く
- 圧縮ファイルがあるので、ダブルクリックしてアーカイブマネージャーで開く
- ファイルマネージャーを開いて、[ホーム]>[phaser]>[phaser-examples]>[examples]>[assets]>[games]>[starstruck]フォルダーを開いて、そこに展開したpng画像を上書きコピーする
- Webブラウザーで http://localhost:8080/sideview.html を開く
- [Fn]+[F12]で開発者ウィンドウを開く
- 再読み込みを長押しして、[キャッシュの消去とハード再読み込み]を選択
- 左のメニューのgame欄から、Star Struck をクリックしてゲームを開始

以上。

